app/controllers/authentication_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "neyder1"], ["LIMIT", 1]]
---
  def authenticate
    auth_token =
      AuthenticateUser.new(auth_params[:username], auth_params[:password]).call
    user = User.where( username: auth_params[:username])