app/controllers/comments_controller.rb

    def create
        comment = Comment.create(params.permit(:user_id, :event_id, :comment))
---
INSERT INTO "comments" ("comment", "user_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "Esa ruta es muy buena"], ["user_id", 1], ["event_id", 1], ["created_at", "2018-11-05 14:42:43.334937"], ["updated_at", "2018-11-05 14:42:43.334937"]]

    def index
        event = Event.find(params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]