app/controllers/events_controller.rb

    def create
        event = Event.create(params.permit(:user_id, :nombre, :sitio_encuentro, :fecha, :picture))
---
INSERT INTO "events" ("nombre", "sitio_encuentro", "fecha", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nombre", "salida 1"], ["sitio_encuentro", "sddsds"], ["fecha", "2018-11-03 21:10:32.321000"], ["created_at", "2018-11-03 21:15:34.304101"], ["updated_at", "2018-11-03 21:15:34.304101"]]

    def destroy
        event = Event.find(params[:id])
        event.delete()
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 1]]