app/controllers/profiels_controller.rb

    def show
        profile = Profile.find(params[:id])
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        profile = Profile.find(params[:id])
        profile.update(profile_params)
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "profiles" SET "email" = $1, "fecnac" = $2, "name" = $3, "updated_at" = $4 WHERE "profiles"."id" = $5  [["email", "neyder123@gmail.com"], ["fecnac", "2018-12-18"], ["name", "Cambio de nombre"], ["updated_at", "2018-12-18 17:06:16.706245"], ["id", 1]]