app/controllers/routes_controller.rb

INSERT INTO "routes" ("map", "description", "created_at", "updated_at", "event_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["map", "fddffdfddf"], ["description", "dsddsdsdsds dsdsds"], ["created_at", "2018-11-20 21:24:53.436846"], ["updated_at", "2018-11-20 21:24:53.436846"], ["event_id", 1]]
---
    def create
        route = Route.create(params.permit(:event_id, :map, :description))

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def index
        event = Event.find(params[:event_id])