app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
INSERT INTO "profiles" ("email", "fecnac", "name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        user = User.create(params.permit(:username, :password))
        profile = Profile.new(profile_params)
        profile.user = user
        profile.save

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def assist
        event = Event.find(params[:idEvent])
        user = User.find(params[:id])

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def cancel_assist
        event = Event.find(params[:idEvent])
        user = User.find(params[:id])

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."email" = $1 LIMIT $2  [["email", "neyder6101@gmail.com"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "neyder6101@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "password_recovery_token" = $1, "password_recovery_expiration" = $2, "updated_at" = $3 WHERE "users"."id" = $4
---
    def password_reset
        @user_email = params['email']
        @perfil = Profile.find_by(email: @user_email)
        @user = User.find(@perfil.user)

        if @user
            password_recovery_token = SecureRandom.hex(32)
            @user.password_recovery_token = password_recovery_token
            @user.password_recovery_expiration = Time.now

            begin
                @user.save!